# panda basic assignment

Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
l=[4,8, 15, 16, 23,42]

In [2]:
import pandas as pd

In [4]:
w=pd.Series(l)

In [7]:
w

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [8]:
list =[1,2,3,4,5,'sanju','rani']

In [10]:
type(list)

list

In [11]:
pd.Series(list)

0        1
1        2
2        3
3        4
4        5
5    sanju
6     rani
dtype: object

Q3. Create a Pandas DataFrame that contains the following data:

Then, print the DataFrame.

In [12]:
data = [['name','Age','Gender'],
       ['Alice',25,'Female'],
       ['Bob',30,'Male'],
       ['Claire',27,'Female']]

In [13]:
data

[['name', 'Age', 'Gender'],
 ['Alice', 25, 'Female'],
 ['Bob', 30, 'Male'],
 ['Claire', 27, 'Female']]

In [26]:
s=pd.DataFrame(data)

In [24]:
s

        0    1       2
0    name  Age  Gender
1   Alice   25  Female
2     Bob   30    Male
3  Claire   27  Female

In [27]:
type(s)

pandas.core.frame.DataFrame

In [31]:
s[0]

0      name
1     Alice
2       Bob
3    Claire
Name: 0, dtype: object

In [33]:
s.head()

        0    1       2
0    name  Age  Gender
1   Alice   25  Female
2     Bob   30    Male
3  Claire   27  Female

In [34]:
s.tail()

        0    1       2
0    name  Age  Gender
1   Alice   25  Female
2     Bob   30    Male
3  Claire   27  Female

In [35]:
s[[0,1]]

        0    1
0    name  Age
1   Alice   25
2     Bob   30
3  Claire   27

In [36]:
s[1]

0    Age
1     25
2     30
3     27
Name: 1, dtype: object

In [39]:
s.to_csv('sanju.csv',index=False)

In [43]:
pd.read_csv('sanju.csv')

        0    1       2
0    name  Age  Gender
1   Alice   25  Female
2     Bob   30    Male
3  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Dataframe : it is two-dimensional tabular data structure with rows and columns,similar to
a spread sheet or SQL table. each data type such as integers,float, string, and boolean.

    
Series :     it is a one-dimensional array-like object that can hold any data 
such as integer, float ,string.

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [44]:
df=pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [46]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [47]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [48]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [49]:
df['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [50]:
df[['Name','Sex','Age']]

                                                  Name     Sex   Age
0                              Braund, Mr. Owen Harris    male  22.0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
2                               Heikkinen, Miss. Laina  female  26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
4                             Allen, Mr. William Henry    male  35.0
..                                                 ...     ...   ...
886                              Montvila, Rev. Juozas    male  27.0
887                       Graham, Miss. Margaret Edith  female  19.0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN
889                              Behr, Mr. Karl Howell    male  26.0
890                                Dooley, Mr. Patrick    male  32.0

[891 rows x 3 columns]

In [51]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [53]:
df[['Name','Sex','Ticket','Cabin']].mean()

/tmp/ipykernel_103/2668555625.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df[['Name','Sex','Ticket','Cabin']].mean()

Series([], dtype: float64)

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [ ]:
ans both dataframe and series are mutable . so, we can manupulate the dataa.
panel is a 3-d data structure in pandas that is used less frequrently  than  series and dataframe .it is also mutable

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [56]:
# ans to create a dataframe using multiple series in pandas, we can first create each series  and then combine them into a dataframe using pd.concat

name = pd.Series(['Alice','bob','ashu','david','eva'])
ages = pd.Series([23,32,12,54,76])
height = ([123,543,123,170,187])

df = pd.concat(name,ages,height,axis=1)

/tmp/ipykernel_103/1195428040.py:7: FutureWarning: In a future version of pandas all arguments of concat except for the argument 'objs' will be keyword-only.
  df = pd.concat(name,ages,height,axis=1)

TypeError: concat() got multiple values for argument 'axis'